app/Http/Controllers/User/BannerController.php

select * from `banners`
---
    public function index()
    {
        $banners = Banner::get();

select * from `project_types`
select * from `banners` where `banners`.`id` = '3' limit 1
select * from `projects` where `projects`.`id` in (2)
---
    public function edit($id)
    {
        $type = ProjectType::all();
        $banner = Banner::with('project')->findOrFail($id);

select * from `banners` where `banners`.`id` = '2' limit 1
select * from `projects` where `id` = '7' limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'project_type_id' => 'required',
            'project_id' => 'required',
//            'images' => 'required',
        ]);
        $banner = Banner::findOrFail($id);
        $project = Project::where('id',$request->project_id)->first();

select * from `banners` where `banners`.`id` = '1' limit 1
---
    public function destroy($id)
    {
        $banner = Banner::findOrFail($id);