app/Http/Controllers/User/BuildingInventoryController.php

select * from `building_floors` where `building_floors`.`id` = '1' limit 1
select * from `building_inventories` where (`building_id` = '1' and `building_floor_id` = '1') order by `created_at` desc
---
    public function index($building_id, $floor_id)
    {
//        return view('form_new');
        $building_floor = BuildingFloor::findOrFail($floor_id);
        $building_inventory = BuildingInventory::with('file')->where(['building_id' => $building_id, 'building_floor_id' => $floor_id])->latest()->get();

select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `projects` where `projects`.`id` in (1)
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `sizes` where `unit` = 'bath' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `types` where exists (select * from `project_types` where `types`.`project_type_id` = `project_types`.`id` and `name` = 'building')
---
    public function create($building_id, $floor_id)
    {
        $building = Building::with('project')->findOrFail($building_id);
        $payment_plan = PaymentPlan::whereHas('type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $category = Category::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $premium = Premium::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $bed = Size::where('unit', 'bed')->whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $bath = Size::where('unit', 'bath')->whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $nature = Type::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();

select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `projects` where `projects`.`id` in (1)
---
    public function store(Request $request, $building_id, $floor_id)
    {
        $building = Building::with('project')->findOrFail($building_id);

select * from `categories` where `categories`.`id` = '2' limit 1
---
                $inventory->status = 'available';
                $inventory->save();

                $category = Category::findOrFail($request->category_id)->name;

insert into `building_inventory_files` (`building_inventory_id`, `file`, `type`, `updated_at`, `created_at`) values (2, 'images/building/flat.jpg', 'image', '2022-12-29 12:40:24', '2022-12-29 12:40:24')
---
                        ]);
//                    }
                } else if ($category == 'Apartment') {
                    BuildingInventoryFile::Create(
                        [
                            'building_inventory_id' => $inventory->id,
                            'file' => 'images/building/flat.jpg',
                            'type' => 'image',
                        ]);

select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `projects` where `type_id` = 1 and `projects`.`id` = 1 limit 1
select * from `building_inventories` where (`building_id` = '1' and `project_id` = 1 and `building_floor_id` = '1') and `building_inventories`.`id` = '1' limit 1
---
    public function show($building_id, $floor_id, $id)
    {
        $building = Building::findOrFail($building_id);
        $project = Project::where('type_id',1)->findOrFail($building->project_id);
        $inventory = BuildingInventory::where(['building_id'=>$building_id,'project_id'=>$project->id,'building_floor_id'=>$floor_id])->findOrFail($id);

select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `projects` where `projects`.`id` in (1)
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `sizes` where `unit` = 'bed' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `sizes` where `unit` = 'bath' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `types` where exists (select * from `project_types` where `types`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `building_inventories` where `building_inventories`.`id` = '17' limit 1
---
    public function edit($building_id, $floor_id, $id)
    {
        $building = Building::with('project')->findOrFail($building_id);
        $category = Category::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $premium = Premium::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $bed = Size::where('unit_id', 'bed')->whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $bath = Size::where('unit_id', 'bath')->whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $nature = Type::whereHas('project_type', function ($q) {
            $q->where('name', 'building');
        })->get();
        $inventory = BuildingInventory::with('file')->findOrFail($id);