app/Http/Controllers/User/BuildingController.php

select * from `buildings` where `project_id` in (1, 2, 3) order by `created_at` desc
select * from `projects` where `projects`.`id` in (1, 2, 3)
---
    public function index()
    {
        $project = get_all_projects('building');
        $buildings = Building::with('project', 'building_file')->whereIn('project_id', $project->pluck('id')->toArray())->latest()->get();

select * from `buildings` where `buildings`.`id` = '1' limit 1
---
    public function show($id)
    {
        $building = Building::findOrFail($id);

select * from `building_files` where 0 = 1
select * from `buildings` where `buildings`.`id` = '1' limit 1
select * from `projects` where `projects`.`id` in (1)
select * from `building_floors`
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'building')
select * from `sizes` where `project_type_id` = 1 and `unit` = 'bed'
---
    public function edit($id)
    {
        $building = Building::with('project', 'building_file')->findOrFail($id);
        $floor = BuildingFloor::get();
        $category = Category::whereHas('project_type', function ($q){
            $q->where('name', 'building');
        })->get();
        $size = Size::where('project_type_id', project_type('building'))->where('unit', 'bed')->get();