app/Http/Controllers/User/BuildingExtraDetailController.php

    public function create($id)
    {
        $plot_features = Feature::where('key','plot')->get();
        $communication_features = Feature::where('key','communication')->get();
        $community_features = Feature::where('key','community')->get();
        $health_features = Feature::where('key','health')->get();
        $other_features = Feature::where('key','other')->get();
---
select * from `features` where `key` = 'plot'
select * from `features` where `key` = 'communication'
select * from `features` where `key` = 'community'
select * from `features` where `key` = 'health'
select * from `features` where `key` = 'other'