app/Http/Controllers/User/ClientController.php

select * from `projects` where `projects`.`id` in (1)
select * from `users` where `users`.`id` in (10)
select * from `countries`
---
    public function index(Request $request)
    {
        $building = get_all_projects();
        $users = get_user_by_projects();
        $lead = get_clients_from_user($users);

        //Search By Project
        if ($request->project) {
            $lead->where('project_id', $request->project);
        }

        //Search By Date From/To
        if ($request->from && $request->to) {
            $from = $request->from;
            $to = $request->to;
            $lead->whereBetween('created_at', [$from, $to]);
        }
        //Table salePersonFilter

        if ($request->salePersonFilter) {
            $lead->where('user_id', $request->salePersonFilter);
        }
        //Table statusFilter

        if ($request->statusFilter) {
            $lead->where('status', $request->statusFilter);
        }
        $clients = $lead->get();
        $sale_persons = User::whereIn('id', $users)
            ->whereHas('roles', function ($q) {
                $q->where('name', 'sale_person');
            })->get();

        $country = Country::get();

select * from `countries`
select * from `clients`
---
    public function create()
    {
        $country = Country::get();
        $users = get_user_by_projects();


        $project = get_all_projects();

        $projects = Project::whereIn('id', $project->pluck('id')->toArray())->get();

        $sales_person = User::whereIn('id', $users)
            ->whereHas('roles', function ($q) {
                $q->where('name', 'sale_person');
            })->get();
        $old_clients = Client::all();

select * from `clients` where `clients`.`id` = '1' limit 1
select * from `client_installments` where `client_id` = '7' order by `due_date` asc
---
    public function show($id)
    {
        $client = Client::findOrFail($id);
        $client_installment = ClientInstallment::where('client_id', $id)->orderBy('due_date', 'ASC')->get();

select * from `clients` where `clients`.`id` = '10' limit 1
---
    public function edit($id)
    {
        $country = Country::get();
        $users = get_user_by_projects();
        $project = get_all_projects();
        $projects = Project::whereIn('id', $project->pluck('project_id')->toArray())->get();
        $sale_persons = User::whereIn('id', $users)
            ->whereHas('roles', function ($q) {
                $q->where('name', 'sale_person');
            })->get();
        $client = Client::with('customer', 'sale_person', 'country', 'state', 'city')->where('id', $id)->first();

select * from `client_histories` where `client_id` = '14' order by `id` desc
---
    public function comments($id)
    {

        $comments = ClientHistory::where('client_id', $id)->orderBy('id', 'desc')->get();

select * from `leads` where 0 = 1
---
    public function lead_assign(Request $request)
    {
        if ($request->sale_id !== null) {
            $sale_id_arr = explode(',', $request->sale_id);
            if (in_array('on', $sale_id_arr)) {
                $arr = array_diff($sale_id_arr, ['on']);
            } else {
                $arr = $sale_id_arr;
            }
            $response = Lead::whereIn('id', $arr)
                ->update([
                    'user_id' => $request->sale_person_id,
                ]);
            if ($response) {
                return redirect()->route('clients.index', ['RolePrefix' => RolePrefix()])->with('success', 'Lead Update Successfully');
            } else {
                return redirect()->route('clients.index', ['RolePrefix' => RolePrefix()])->with('error', 'SomeThing Went Wrong');
            }
        } else {
            return redirect()->route('clients.index', ['RolePrefix' => RolePrefix()])->with('error', 'Please select first any lead');

select * from `countries`
select * from `users` where 0 = 1
select * from `states` where `states`.`id` in (165)
select * from `clients` where `id` = '9' limit 1
select * from `countries` where `countries`.`id` in (0)
select * from `clients`
---
    public function client_transfered($id)
    {
        $country = Country::get();
        $users = get_user_by_projects();
        $project = get_all_projects();
        $projects = Project::whereIn('id', $project->pluck('id')->toArray())->get();
        $sale_persons = User::whereIn('id', $users)
            ->whereHas('roles', function ($q) {
                $q->where('name', 'sale_person');
            })->get();
        $client = Client::with('customer', 'sale_person', 'country', 'state', 'city')->where('id', $id)->first();
        $clients = Client::with('customer')->get();

select * from `clients` where `id` = '10' limit 1
select * from `countries`
select * from `states` where 0 = 1
select * from `cities` where 0 = 1
select * from `users` where `users`.`id` in (10)
insert into `clients` (`project_id`, `project_type_id`, `inventory_id`, `customer_id`, `user_id`, `name`, `email`, `password`, `number`, `alt_phone`, `address`, `cnic`, `down_payment`, `dob`, `father_name`, `country_id`, `state_id`, `city_id`, `hidden_file_number`, `created_by`, `status`, `updated_at`, `created_at`) values (4, 2, 2, '', 10, 'Chase Zamora', 'caweh@mailinator.com', 'Pa$$w0rd!', '203', '+1 (542) 918-5026', 'Non delectus est e', '22', '91', '1977-12-26', 'Damian Fowler', 'Select Country', '', '', '', 10, 'mature', '2022-12-22 11:20:34', '2022-12-22 11:20:34')
update `clients` set `status` = 'transfered', `clients`.`updated_at` = '2022-12-22 11:20:34' where `id` = '10'
---
    public function transfered_store(Request $request)
    {
        $client = Client::where('id', $request->client_trnafer_id)->first();
        $client_data = [
            'project_id' => $client->project_id,
            'project_type_id' => $client->project_type_id,
            'inventory_id' => $client->inventory_id,
            'customer_id' => Null,
            'user_id' => auth()->user()->id,
            'name' => $request->name_new,
            'email' => $request->email_new,
            'password' => $request->password_new,
            'number' => $request->phone_number_new,
            'alt_phone' => $request->alt_phone_new,
            'address' => $request->address_new,
            'cnic' => $request->cnic_new,
            'down_payment' => $request->down_payment,
            'dob' => $request->dob_new,
            'father_name' => $request->father_name_new,
            'country_id' => $request->country_id_new,
            'state_id' => $request->state_id_new,
            'city_id' => $request->city_id_new,
            'hidden_file_number' => "",
            'down_payment' => $request->down_payment,
            'created_by' => auth()->user()->id,
            'status' => 'mature',
        ];
        $client_res = Client::create($client_data);
        //client Status update and create history
        Client::where('id', $request->client_trnafer_id)->update(['status' => 'transfered']);

insert into `clients` (`project_id`, `project_type_id`, `inventory_id`, `registration_number`, `customer_id`, `user_id`, `name`, `email`, `password`, `number`, `alt_phone`, `address`, `cnic`, `down_payment`, `dob`, `father_name`, `country_id`, `state_id`, `city_id`, `hidden_file_number`, `created_by`, `status`, `updated_at`, `created_at`) values (1, 1, 6, '49085', 9, 10, 'Megan Parrish', 'lilecu@mailinator.com', 'Pa$$w0rd!', '613', '+1 (309) 305-9019', 'Consequuntur corrupt', '94', '', '1997-08-14', 'Eliana Ellis', 'Select Country', '', '', '', 10, 'mature', '2023-01-02 10:24:20', '2023-01-02 10:24:20')
---
            'comment' => 'Client Avtive Now',
            'is_read' => 0,
        ];
        ClientHistory::create($client_histories_data);

select * from `countries`
select * from `cities` where 0 = 1
select * from `states` where 0 = 1
select * from `users` where `users`.`id` in (10)
---
    public function active(Request $request, $id)
    {
        if (!empty($request->building_id)) {
            $project_id = json_decode($request->building_id)->id;
        } else {
            $project_id = Null;
        }
        if (!empty($request->building_id)) {
            $type_id = json_decode($request->building_id)->type_id;
        } else {
            $type_id = Null;
        }
        if (is_numeric($request->inventory_id)) {
            $inventory_id = $request->inventory_id;
        } else {
            $inventory_id = Null;
        }

        $client_data = [
            'project_id' => $project_id,
            'project_type_id' => $type_id,
            'inventory_id' => $inventory_id,
            'user_id' => (!empty($request->sale_person_id)) ? $request->sale_person_id : Null,
            'name' => $request->name_new,
            'email' => $request->email_new,
            'password' => $request->password_new,
            'number' => $request->phone_number_new,
            'alt_phone' => $request->alt_phone_new,
            'address' => $request->address_new,
            'cnic' => $request->cnic_new,
            'down_payment' => $request->down_payment,
            'dob' => $request->dob_new,
            'father_name' => $request->father_name_new,
            'country_id' => $request->country_id_new,
            'state_id' => $request->state_id_new,
            'city_id' => $request->city_id_new,
            'hidden_file_number' => "",
            'down_payment' => $request->down_payment,
            'created_by' => auth()->user()->id,
            'status' => 'mature',
        ];

update `clients` set `project_id` = 1, `project_type_id` = 1, `inventory_id` = '22', `user_id` = '10', `name` = 'Sydney Waller', `email` = 'xogorofu@mailinator.com', `password` = 'Pa$$w0rd!', `number` = '936', `alt_phone` = '', `address` = '', `cnic` = '45', `down_payment` = '69', `dob` = '', `father_name` = 'Guy Eaton', `country_id` = 'Select Country', `state_id` = '', `city_id` = '', `hidden_file_number` = '', `created_by` = 10, `status` = 'mature', `clients`.`updated_at` = '2023-01-02 08:05:49' where `id` = '16'
---
        $update_data = [
            'status' => 'active',
        ];
        Client::where('id', $id)->update($update_data);