app/Http/Controllers/User/ClientController.php

    public function lead_assign(Request $request)
    {
        if ($request->sale_id !== null) {
            $sale_id_arr = explode(',', $request->sale_id);
            if (in_array('on', $sale_id_arr)) {
                $arr = array_diff($sale_id_arr, ['on']);
            } else {
                $arr = $sale_id_arr;
            }
            $response = Lead::whereIn('id', $arr)
                ->update([
                    'user_id' => $request->sale_person_id,
                ]);
---
select * from `leads` where `leads`.`id` in (2, 3, 4, 5, 6)

            'created_by' => auth()->user()->id,
            'status' => 'mature',
        ];
        $response = Client::where('id', $id)->update($client_data);
---
update `clients` set `status` = 'active', `clients`.`updated_at` = '2023-01-02 08:05:49' where `id` = '16'