app/Http/Controllers/User/DealerController.php

    public function index()
    {
        $dealers = Dealer::with('project')->get();
---
select * from `dealers`

    protected function dealer_project_detail($dealer_id,$project_id)
    {
        $dealer = Dealer::findOrFail($dealer_id);
        $project = Project::findOrFail($project_id);
        $projects = DealerProject::where(['dealer_id'=>$dealer_id,'project_id'=>$project_id])->get();
        $inventory = [];
        foreach ($projects as $val){
            $list = json_decode($val->inventory_list);
            $inventory = array_merge($inventory,$list);
        }
        $controller = new ProjectController();
        $floors = $controller->get_floor_block($project->id)->getData();
        $project_array = [];
        $floor_id_arr = array_column($floors,'id');
        foreach($floors as $floor){
            if($project->type_id == 1){
                $inventories = BuildingInventory::whereIn('id',$inventory)->where('project_id',$project->id)->where('building_floor_id',$floor->id)->get();
                $project_array[$floor->name] = $inventories;
            }elseif($project->type_id == 2){
                $inventories = SocietyInventory::whereIn('id',$inventory)->where('project_id',$project->id)->where('block_id',$floor->id)->get();
                $project_array[$floor->name] = $inventories;
            }elseif($project->type_id == 3){
                $inventories = Farmhouse::whereIn('id',$inventory)->where('project_id',$project->id)->where('block_id',$floor->id)->get();
                $project_array[$floor->name] = $inventories;
            }
        }
        if($project->type_id == 1){
            $inventories = BuildingInventory::where('project_id',$project->id)->whereNotIn('building_floor_id',$floor_id_arr)->whereIn('id',$inventory)->get();
---
select * from `dealers` where `dealers`.`id` = '1' limit 1
select * from `projects` where `projects`.`id` = '1' limit 1
select * from `dealer_projects` where (`dealer_id` = '1' and `project_id` = '1')
select * from `building_inventories` where 0 = 1 and `project_id` = 1 and `building_floor_id` = 1
select * from `building_inventories` where `project_id` = 1 and `building_floor_id` not in (1, 2, 6) and 0 = 1