app/Http/Controllers/User/EmailController.php

                    $email_history->images = implode(',',$data['image']);
                    $email_history->status = 'sent';
                    $email_history->date = date('Y-m-d H:i:s');
                    $email_history->save();
---
insert into `email_histories` (`send_by`, `to`, `subject`, `body`, `images`, `status`, `date`, `updated_at`, `created_at`) values (9, 'mybiceli@mailinator.com', 'Voluptas mollit volu', '', '', 'sent', '2022-12-26 10:42:55', '2022-12-26 10:42:55', '2022-12-26 10:42:55')

    public function send_email()
    {
        $email_histories = EmailHistory::where(['send_by'=>Auth::user()->id,'status'=>'sent'])->get();
---
select * from `email_histories` where (`send_by` = 9 and `status` = 'sent')

    public function draft_email()
    {
        $email_histories = EmailHistory::where(['send_by'=>Auth::user()->id,'status'=>'draft'])->get();
---
select * from `email_histories` where (`send_by` = 9 and `status` = 'draft')