app/Http/Controllers/User/FarmhouseController.php

    public function show($id)
    {
        $farmhouse_block = Farmhouse::findOrFail($id);
        $block_id = json_decode($farmhouse_block->block);
        $blocks = Block::whereIn('id',$block_id)->get();
---
select * from `blocks` where `id` in ('6')