app/Http/Controllers/User/FarmhouseInventoryController.php

    public function create($farmhouse_id,$block_id)
    {
        $farmhouse = Farmhouse::findOrFail($farmhouse_id);
        $block = Block::findOrFail($block_id);
        $type_id = json_decode($farmhouse->type);
        $category = Category::whereIn('id',$type_id)->get();
        $sizes = Size::where('project_type_id',project_type('farm_house'))->get();
---
select * from `blocks` where `blocks`.`id` = '6' limit 1
select * from `sizes` where `project_type_id` = 3