app/Http/Controllers/User/FarmhouseInventoryController.php

    public function __construct()
    {
        $id = ProjectType::where('name','farm_house')->first()->id;
---
select * from `project_types` where `name` = 'farm_house' limit 1

    public function create($id)
    {
        $project = Project::findOrFail($id);
        $sizes = Size::get();
        $project_type_id = $this->project_type_id;
        $premiums = Premium::where('project_type_id',$project_type_id)->get();
        $blocks = Block::where('project_type_id',$project_type_id)->get();
---
select * from `projects` where `projects`.`id` = '7' limit 1
select * from `sizes`
select * from `blocks` where `project_type_id` = 3