app/Http/Controllers/User/FarmhouseController.php

select * from `project_types` where `name` = 'farm_house' limit 1
---
    public function __construct()
    {
        $id = ProjectType::where('name','farm_house')->first()->id;