app/Http/Controllers/User/MemberShipController.php

select * from `clients` where `clients`.`id` in (1, 2)
select * from `forms` where `type` = 'membership'
---
    public function index()
    {
        $membership = Form::with('client')->where('type', 'membership')->get();

select * from `clients`
---
    public function create()
    {
        $clients = Client::get();

insert into `forms` (`client_id`, `project_id`, `application_no`, `fee`, `passport_no`, `current_address`, `permanent_address`, `occupation`, `phone_no_office`, `phone_no_res`, `nominee_name`, `nominee_father_name`, `nominee_cnic`, `nominee_passport_no`, `relationship`, `property_type`, `total_price`, `booking_price`, `down_payment`, `installment`, `payment_type`, `cash_receipt`, `type`, `barcode`, `project_logo`, `updated_at`, `created_at`) values ('', '2', 'Quos et aut quia qui', 'Aliqua Asperiores n', 'Est minima quasi vol', 'Nihil magni rerum ex', 'Consequuntur volupta', 'Nostrum ut eos aut l', '+1 (594) 579-6263', '+1 (888) 654-5926', 'Salvador Dunlap', 'Quyn Fulton', 'Veritatis odio sit r', 'Dolorem adipisci ea', 'Nisi elit consequat', 'apartment', '280', '731', 'Et in modi unde nisi', 'Laborum Possimus i', 'cheque', 'Repellendus Sed non', 'membership', 'https://www.google.com/', 'images/form/1754636139731856.png', '2023-01-10 16:50:21', '2023-01-10 16:50:21')
---
                $form->project_logo = $file;
            }
        }
        $form->save();

select * from `forms` where `forms`.`id` = '1' limit 1
select * from `clients`
---
    public function edit($id)
    {
        $form = Form::findOrFail($id);
        $clients = Client::get();

select * from `forms` where `forms`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'project_id' => 'required',
            'fee' => 'required',
        ]);
        $form = Form::findOrFail($id);

update `forms` set `client_id` = '2', `forms`.`updated_at` = '2023-01-10 17:10:31' where `id` = 1
---
                $form->project_logo = $file;
            }
        }
        $form->save();

select * from `forms` where `forms`.`id` = '4' limit 1
delete from `forms` where `id` = 4
---
    public function destroy($id)
    {
        $form = Form::findOrFail($id);
        $form->delete();