app/Http/Controllers/User/PaymentPlanController.php

select * from `project_types`
---
    public function edit($id)
    {
        $project_type = ProjectType::get();