app/Http/Controllers/User/PaymentPlanController.php

    public function index()
    {
        $payment_plan = PaymentPlan::get();
---
select * from `payment_plans`

    public function create()
    {
        $project_type = ProjectType::get();
---
select * from `project_types`

    public function edit($id)
    {
        $project_type = ProjectType::get();
        $payment_plan = PaymentPlan::findOrFail($id);
---
select * from `project_types`
select * from `payment_plans` where `payment_plans`.`id` = '5' limit 1

    public function update(Request $request, $id)
    {
        $request->validate([
            'project_type_id' => 'required',
            'name' => 'required',
            'total_price' => 'required',
            'premium_id' => 'required',
            'total_month_installment' => 'required',
            'per_month_installment' => 'required',
            'down_payment_select' => 'required',
            'down_payment' => 'required',
        ]);
        if($request->premium_id !== "regular"){
            $request->validate([
                'commission' => 'required',
                'after_commission_price' => 'required',
            ]);
        }
        $payment_plan = PaymentPlan::findOrFail($id);
---
select * from `payment_plans` where `payment_plans`.`id` = '1' limit 1

    public function destroy($id)
    {
        $payment_plan = PaymentPlan::findOrFail($id);
---
select * from `payment_plans` where `payment_plans`.`id` = '1' limit 1

    public function get_payment_plan($premium_id,$project_type_id)
    {
        if($premium_id !== 'regular'){
            $payment_plan = PaymentPlan::where(['project_type_id'=>$project_type_id,'premium_id'=>$premium_id])->get();
        }else{
            $payment_plan = PaymentPlan::where('project_type_id',$project_type_id)->where('premium_id',null)->get();
---
select * from `payment_plans` where (`project_type_id` = '1' and `premium_id` = '0')