app/Http/Controllers/User/ProjectController.php

    public function create()
    {
        //        $i=1;
        //        $x=0;
        //        $n=0;
        //        while($i<10){
        //            if($i<=5){
        //                echo $i."<br>";
        //            }
        //            $i++;
        //            if($i>5){
        //                $x=$x+2;
        //                $n = $i-$x;
        //                echo $n."<br>";
        //            }
        //        }
        //        die();
        $project = Project::get();
        $project_type = ProjectType::latest()->get();
        $floor = BuildingFloor::get();
        $building_category = Category::where('project_type_id', project_type('building'))->get();
        $building_size = Size::where('project_type_id', project_type('building'))->where('unit', 'bed')->get();

        $society_size = Size::where('project_type_id', project_type('society'))->get();
        $society_category = Category::where('project_type_id', project_type('society'))->get();
        $noc = NocType::get();
        $society_block = Block::where('project_type_id', project_type('society'))->get();

        $formhouse_block = Block::where('project_type_id', project_type('farm_house'))->get();
        $formhouse_category = Category::where('project_type_id', project_type('farm_house'))->get();

        $plot_features = Feature::where('key', 'plot')->get();
        $communication_features = Feature::where('key', 'communication')->get();
        $community_features = Feature::where('key', 'community')->get();
        $health_features = Feature::where('key', 'health')->get();
        $other_features = Feature::where('key', 'other')->get();
---
select * from `projects`
select * from `noc_types`
select * from `project_types` order by `created_at` desc
select * from `building_floors`
select * from `categories` where `project_type_id` = 2
select * from `sizes` where `project_type_id` = 1 and `unit` = 'bed'
select * from `sizes` where `project_type_id` = 2
select * from `categories` where `project_type_id` = 3
select * from `blocks` where `project_type_id` = 2
select * from `blocks` where `project_type_id` = 3
select * from `features` where `key` = 'communication'
select * from `features` where `key` = 'community'
select * from `features` where `key` = 'health'
select * from `features` where `key` = 'other'

            $project_assign_user->user_id = Auth::user()->id;
            $project_assign_user->save();

            $type = ProjectType::findOrFail($request->project_type_id)->name;
---
select * from `projects` where `type_id` = '1'

    public function show($id)
    {
        $project = Project::findOrFail($id);
        if ($project->type_id == 1) {
            $building = Building::where('project_id',$id)->first();
            return view('user.building.floor_index', compact('building'));
        } elseif ($project->type_id == 2) {
            $society_block = Society::where('project_id',$id)->first();
---
select * from `projects` where `projects`.`id` = '23' limit 1
select * from `buildings` where `project_id` = '23' limit 1
select * from `societies` where `project_id` = '27' limit 1

    public function edit($id)
    {
        $project = Project::with('building_detail')->findOrFail($id);
        if ($project->type_id == 1) {
            $project_detail = Building::where('project_id', $id)->first();
        } elseif ($project->type_id == 2) {
            $project_detail = Society::where('project_id', $id)->first();
        } elseif ($project->type_id == 3) {
            $project_detail = Farmhouse::where('project_id', $id)->first();
        } else {
            $project_detail = Property::where('project_id', $id)->first();
        }

        $floor = BuildingFloor::get();
        $building_category = Category::where('project_type_id', project_type('building'))->get();
---
select * from `projects` where `projects`.`id` = '27' limit 1
select * from `categories` where `project_type_id` = 3

    public function destroy($id)
    {
        $project = Project::findOrFail($id);
---
select * from `projects` where `id` = 1 limit 1