app/Http/Controllers/User/ProjectController.php

    public function index()
    {
        $projects = Project::latest()->get();
---
select * from `projects` order by `created_at` desc

    public function create()
    {
        $project = Project::get();
        $project_type = ProjectType::latest()->get();
---
select * from `projects`
select * from `project_types` order by `created_at` desc

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'type_id' => 'required',
        ]);

        $project_limit = Project::get();
        if (Auth::user()->project == count($project_limit)) {
            return redirect()->back()->with($this->message('Project Limit Complete. Please Contact Super Admin', 'warning'));
        } else {
            $project = new Project();
            $project->name = $request->name;
            $project->type_id = $request->type_id;
            $project->save();

            $project_assign_user = new ProjectAssignUser();
            $project_assign_user->project_id = $project->id;
            $project_assign_user->user_id = Auth::user()->id;
            $project_assign_user->save();

            $type = ProjectType::findOrFail($request->type_id)->name;

            if ($type == 'society') {
                Society::create(['project_id' => $project->id]);
            } elseif ($type == 'building') {
                Building::create(['project_id' => $project->id]);
---
insert into `projects` (`name`, `type_id`, `updated_at`, `created_at`) values ('Ali Hassan', '1', '2022-12-29 09:36:45', '2022-12-29 09:36:45')
insert into `project_assign_users` (`project_id`, `user_id`, `updated_at`, `created_at`) values (13, 9, '2022-12-29 09:36:45', '2022-12-29 09:36:45')
select * from `project_types` where `project_types`.`id` = '1' limit 1
insert into `buildings` (`project_id`, `updated_at`, `created_at`) values (13, '2022-12-29 09:36:45', '2022-12-29 09:36:45')

    public function get_project($id)
    {
        $projects = Project::where('type_id',$id)->get();
---
select * from `projects` where `type_id` = '1'