app/Http/Controllers/User/SizeController.php

select * from `sizes` order by `created_at` desc
---
    public function index()
    {
        $sizes = Size::get();

select * from `project_types` order by `created_at` desc
---
    public function create()
    {
        $project_type = ProjectType::get();

select * from `sizes` where `sizes`.`id` = '1' limit 1
select * from `project_types` order by `created_at` desc
select * from `units` order by `created_at` desc
---
    public function edit($id)
    {
        $size = Size::findOrFail($id);
        $project_type = ProjectType::get();
        $unit = Unit::get();

select * from `sizes` where not `id` = '7' and `project_type_id` = '2' and `name` = 'Kalia Walters' limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'type_id' => 'required',
            'name' => 'required',
        ]);
        $size = Size::findOrFail($id);
        $size->project_type_id = $request->type_id;
        $size->name = $request->name;
        $size->save();
        if ($size){
            return redirect()->route('size.index', ['RolePrefix' => RolePrefix()])->with(['message' => 'Size update successfully', 'alert' => 'success']);