app/Http/Controllers/User/SocietyController.php

select * from `projects` where `projects`.`id` in (14)
select * from `societies` where `project_id` in (13, 14) order by `created_at` desc
---
    public function index()
    {
        $project = get_all_projects('society');
        $societies = Society::with('project','society_file')->whereIn('project_id', $project->pluck('id')->toArray())->latest()->get();

select * from `societies` where exists (select * from `projects` where `societies`.`project_id` = `projects`.`id` and exists (select * from `project_types` where `projects`.`type_id` = `project_types`.`id` and `name` = 'society')) and `societies`.`id` = '4' limit 1
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `societies` where exists (select * from `projects` where `societies`.`project_id` = `projects`.`id` and exists (select * from `project_types` where `projects`.`type_id` = `project_types`.`id` and `name` = 'society')) and `societies`.`id` = '1' limit 1
select * from `sizes` where exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'society') and `unit` in ('marla', 'kanal')
select * from `noc_types`
select * from `countries`
select * from `blocks` where exists (select * from `project_types` where `blocks`.`project_type_id` = `project_types`.`id` and `name` = 'society')
---
    public function edit($id)
    {
        $society = Society::whereHas('project', function ($q) {
                $q->whereHas('type', function ($q) {
                    $q->where('name', 'society');
                });
            })
            ->findOrFail($id);
        $category = Category::whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();
        $size = Size::whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->whereIn('unit', ['marla', 'kanal'])->get();
        $noc = NocType::get();
        $country = Country::get();
        $block = Block::whereHas('project_type', function ($q){
            $q->where('name', 'society');
        })->get();