app/Http/Controllers/User/SocietyInventoryController.php

select * from `blocks` where `blocks`.`id` in (1)
select * from `categories` where `categories`.`id` in (7, 9, 10)
select * from `payment_plans` where `payment_plans`.`id` in (1)
select * from `projects` where `projects`.`id` in (3)
select * from `blocks` where `blocks`.`id` = '1' limit 1
---
    public function index($society_id, $block_id)
    {
        $society_inventory = SocietyInventory::with('project', 'block', 'category', 'payment_plan', 'nature', 'size', 'premium', 'file')->where(['society_id' =>
            $society_id, 'block_id' => $block_id])->latest()->get();
        $block = Block::findOrFail($block_id);

select * from `projects` where `projects`.`id` in (4)
select * from `societies` where `societies`.`id` = '1' limit 1
select * from `types` where exists (select * from `project_types` where `types`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `sizes` where `unit` = 'bed' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'society')
---
    public function create($society_id, $block_id)
    {
        $society = Society::with('project')->findOrFail($society_id);
        $category = Category::whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();
        $premium = Premium::whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();
        $bed = Size::where('unit', 'bed')->whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();
        $bath = Size::where('unit', 'bath')->whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();
        $plot_size = Size::whereIn('unit', ['marla', 'kanal'])->whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();
        $nature = Type::whereHas('project_type', function ($q) {$q->where('name', 'society');})->get();

select * from `projects` where `projects`.`id` in (4)
select * from `societies` where `societies`.`id` = '1' limit 1
select * from `society_inventories` where `society_inventories`.`id` = '4' limit 1
select * from `categories` where exists (select * from `project_types` where `categories`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `sizes` where `unit` = 'bed' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `sizes` where `unit` = 'bath' and exists (select * from `project_types` where `sizes`.`project_type_id` = `project_types`.`id` and `name` = 'society')
select * from `sizes` where `unit` in ('marla', 'kanal')
select * from `types` where exists (select * from `project_types` where `types`.`project_type_id` = `project_types`.`id` and `name` = 'society')
---
    public function edit($society_id, $block_id, $id)
    {
        $society = Society::with('project')->findOrFail($society_id);
        $society_inventory = SocietyInventory::findOrFail($id);
        $category = Category::whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();
        $premium = Premium::whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();
        $bed = Size::where('unit', 'bed')->whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();
        $bath = Size::where('unit', 'bath')->whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();
        $plot_size = Size::whereIn('unit', ['marla', 'kanal'])->get();
        $nature = Type::whereHas('project_type', function ($q) {
            $q->where('name', 'society');
        })->get();