app/Http/Controllers/User/TargetController.php

select * from `targets` where `assign_to` = 9
---
    public function my_targets()
    {
        $targets = Target::where('assign_to',Auth::user()->id)->get();

select * from `targets` where `user_id` = 9 and `assign_to` != 9
select * from `users` where `users`.`id` in (10, 11)
---
    public function staff_targets()
    {
        $targets = Target::with('assign')->where('user_id',Auth::user()->id)->where('assign_to','!=',Auth::user()->id)->get();

select * from `targets` where `targets`.`id` = '1' limit 1
---
    public function edit_task($id)
    {
        $target = Target::findOrFail($id);

select * from `users` where `users`.`id` = '9' limit 1
---
    public function get_report($id)
    {
        $user = User::findOrFail($id);