app/Http/Controllers/User/TermController.php

    public function index()
    {
        $terms = TermsAndCondition::get();
---
select * from `terms_and_conditions`

    public function store(Request $request)
    {
        $request->validate([
            'description' => 'required',
        ]);
        $term = new TermsAndCondition();
        $term->description = $request->description;
        $term->save();
---
insert into `terms_and_conditions` (`description`, `updated_at`, `created_at`) values ('<ol><li>okcoks</li><li>vasodv</li><li>vikms</li></ol>', '2022-12-29 07:02:22', '2022-12-29 07:02:22')