app/Helpers/Helpers.php

select * from `project_assign_users` where 0 = 1 and `user_id` != 9 group by `user_id`
---
    function get_user_by_projects()
    {
        $project = ProjectAssignUser::where('user_id', auth()->user()->id)->get();

select * from `project_types` where `name` = 'building' limit 1
---
    function project_type($type){
        return ProjectType::where('name', $type)->first()->id;

select * from `project_assign_users` where `user_id` = 9
---
    function get_all_projects($type = null)
    {
        if ($type !== null){
            $project_type = project_type($type);
            $list = ProjectAssignUser::where('user_id', Auth::id())->get();
            return Project::whereIn('id', $list->pluck('project_id')->toArray())->where('type_id', $project_type)->get();
        } else {
            $list = ProjectAssignUser::where('user_id', Auth::id())->get();

select * from `building_inventories` where `building_inventories`.`id` = '6' limit 1
---
    function get_inventory($type_id,$inventory_id)
    {
        if($type_id == 1){
            $inventory = BuildingInventory::findOrFail($inventory_id);
        }elseif ($type_id == 2){
            $inventory = SocietyInventory::findOrFail($inventory_id);
        }elseif ($type_id == 3){
            $inventory = Farmhouse::findOrFail($inventory_id);
        }else{
            $inventory = Property::findOrFail($inventory_id);

select * from `payment_plans` where `payment_plans`.`id` = 3 limit 1
---
    function installment($payment_plan_id)
    {
        $payment_plan = PaymentPlan::findOrFail($payment_plan_id);

select * from `client_installments` where `client_id` = '5' limit 1
insert into `client_installments` (`client_id`, `title`, `installment_amount`, `due_date`, `type`, `status`, `created_at`, `updated_at`) values (1, 'down_payment', 1050000, '2037-12-13 08:08:23', 'installment', 'paid', '2022-12-13 08:08:23', '2022-12-13 08:08:23')
---
    function create_installment_plan($client_id,$installment,$request)
    {
        $installment_check = ClientInstallment::where('client_id',$client_id)->first();
//        if ($request->down_payment !== $installment['payment_plan']->total_price) {
        if ($request !== $installment['payment_plan']->total_price) {
            if ($installment_check == null) {
                foreach ($installment['amount'] as $data) {
//                    dd($data);
                    if(in_array($data['title'],['down_payment','confirmation_amount'])){
                        $status = 'paid';
                    }else{
                        $status = 'not_paid';
                    }
                    if(!$data['amount']){
                        continue;
                    }
                    ClientInstallment::create([
                        'client_id' => $client_id,
                        'title' => $data['title'],
                        'installment_amount' => $data['amount'],
                        'due_date' => $data['due_date'],
                        'type' => 'installment',
                        'status' => $status,
                        'created_at' => $data['created_at']
                    ]);