app/Helpers/Helpers.php

select * from `project_assign_users`
---
    function get_user_by_projects()
    {
        if (Auth::user()->roles[0]->name == 'property_admin') {
            $project = ProjectAssignUser::get();

select * from `projects` where `id` in (1, 2, 3, 4, 5, 6, 8, 9) and `type_id` = 1
---
    function get_all_projects($type = null)
    {
        if ($type !== null) {
            //for admin
            if (Auth::user()->roles[0]->name == 'property_admin') {
                $project_type = project_type($type);
                return Project::where('type_id', $project_type)->get();

select * from `payment_plans` where `payment_plans`.`id` = 2 limit 1
---
    function installment($payment_plan_id)
    {
        $payment_plan = PaymentPlan::findOrFail($payment_plan_id);