app/Models/Accounts_model.php

    public static function get_userlist()
    {
        $query =  DB::table('acc_coa')
            ->select('*')
            ->where('IsActive', 1)
            ->orderBy('HeadName');

        if ($query->count() >= 1) {
            return $query->get();
---
select count(*) as aggregate from `acc_coa` where `IsActive` = 1
select * from `acc_coa` where `IsActive` = 1 order by `HeadName` asc

    public static function get_coahead()
    {
        $query =  DB::table('acc_coa')
            ->select('*')
            ->where('PHeadName', 'COA')
            ->where('IsActive', 1)
            ->orderBy('HeadName');


        if ($query->count() >= 1) {
            return $query->get();
---
select count(*) as aggregate from `acc_coa` where `PHeadName` = 'COA' and `IsActive` = 1
select * from `acc_coa` where `PHeadName` = 'COA' and `IsActive` = 1 order by `HeadName` asc

    public function sub_parents($pheadname)
    {

        $query =  DB::table('acc_coa')
            ->select('*')
            ->where('PHeadName', $pheadname)
            ->where('IsActive', 1)
            ->orderBy('HeadName');
        $pheadlist = $query->get();
---
select * from `acc_coa` where `PHeadName` = 'Assets' and `IsActive` = 1 order by `HeadName` asc

    public static  function allphead_dropdown($pheadname)
    {

        $obj = new Accounts_model();
        $query =  DB::table('acc_coa')
            ->select('*')
            ->where('PHeadName', $pheadname)
            ->where('IsActive', 1)
            ->orderBy('HeadName');
        $pheadlist = $query->get();
---
select * from `acc_coa` where `PHeadName` = 'COA' and `IsActive` = 1 order by `HeadName` asc

    public static  function approve_voucher()
    {

        //   return $approveinfo = DB::select("SELECT *, SUM(Debit) as totaldebit, SUM(Credit) as totalcredit
        //   FROM `acc_transaction`
        //   WHERE `Vtype` IN('DV', 'CV', 'JV', 'Contra')
        //   AND `IsAppove` =0
        //   GROUP BY `VNo`");


        //$values = array("DV", "CV", "JV", "Contra");
        //$approveinfo = DB::table('acc_transaction')->select('*',DB::raw('SUM(Debit) AS totaldebit'), DB::raw('SUM(Credit) AS totalcredit'))

        //return $approveinfo = DB::table('acc_transaction')
        //	->select(['*',DB::raw("SUM(Debit) as totaldebit"), DB::raw("SUM(Credit) as totalcredit")])
        //->whereIn('Vtype', $values)
        //->where('IsAppove', 0)
        //->groupBy('VNo')
        //->sum(DB::raw('SUM(Debit) AS totaldebit'))
        //->get();

        return $approveinfo = DB::table('acc_transaction')->select('*')
            ->where('IsAppove', 0)
            ->get();
---
select * from `acc_transaction` where `IsAppove` = 0