app/Providers/AppServiceProvider.php

select * from `admin_permissions` limit 1
---
    public function boot()
    {
        view()->composer('*',function($view) {
            $view->with('permissions', AdminPermission::first());